{"class_name": "Sequential", "keras_version": "2.1.5", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "use_bias": true, "stateful": false, "recurrent_constraint": null, "recurrent_dropout": 0.0, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "return_sequences": true, "trainable": true, "return_state": false, "dropout": 0.0, "units": 60, "go_backwards": false, "bias_regularizer": null, "unroll": false, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "kernel_regularizer": null, "name": "lstm_77", "activity_regularizer": null, "batch_input_shape": [null, 60, 2], "activation": "tanh", "unit_forget_bias": true, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_77", "noise_shape": null, "rate": 0.2}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "use_bias": true, "stateful": false, "recurrent_constraint": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "return_sequences": true, "trainable": true, "return_state": false, "dropout": 0.0, "units": 100, "go_backwards": false, "bias_regularizer": null, "unroll": false, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "kernel_regularizer": null, "name": "lstm_78", "activity_regularizer": null, "activation": "tanh", "unit_forget_bias": true, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_78", "noise_shape": null, "rate": 0.2}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "use_bias": true, "stateful": false, "recurrent_constraint": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "return_sequences": true, "trainable": true, "return_state": false, "dropout": 0.0, "units": 100, "go_backwards": false, "bias_regularizer": null, "unroll": false, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "kernel_regularizer": null, "name": "lstm_79", "activity_regularizer": null, "activation": "tanh", "unit_forget_bias": true, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_79", "noise_shape": null, "rate": 0.2}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "use_bias": true, "stateful": false, "recurrent_constraint": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "return_sequences": false, "trainable": true, "return_state": false, "dropout": 0.0, "units": 40, "go_backwards": false, "bias_regularizer": null, "unroll": false, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "kernel_regularizer": null, "name": "lstm_80", "activity_regularizer": null, "activation": "tanh", "unit_forget_bias": true, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_80", "noise_shape": null, "rate": 0.2}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "units": 1, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "dense_20", "activity_regularizer": null, "trainable": true, "activation": "relu", "use_bias": true}}]}